# Fire up Turi Create

We always start with this line before using any part of Turi Create

In [5]:
import pandas as pd

# Load a tabular data set

In [6]:
sf = pd.read_csv('people-example.csv')

# SFrame basics

In [7]:
sf #we can view first few lines of table

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [8]:
sf.tail()  # view end of the table

  First Name Last Name        Country  age
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

# Turi Create visualization

In [10]:
# .show() visualizes any data structure in Turi Create
sf.head()

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23

In [11]:
sf['age'].head()

0    24
1    23
2    22
3    23
4    23
Name: age, dtype: int64

# Inspect columns of dataset

In [12]:
sf['Country']

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [13]:
sf['age']

0    24
1    23
2    22
3    23
4    23
5    22
6    25
Name: age, dtype: int64

Some simple columnar operations

In [14]:
sf['age'].mean()

23.142857142857142

In [15]:
sf['age'].max()

25

# Create new columns in our SFrame

In [16]:
sf

  First Name Last Name        Country  age
0        Bob     Smith  United States   24
1      Alice  Williams         Canada   23
2    Malcolm      Jone        England   22
3      Felix     Brown            USA   23
4       Alex    Cooper         Poland   23
5        Tod  Campbell  United States   22
6      Derek      Ward    Switzerland   25

In [17]:
sf['Full Name'] = sf['First Name'] + ' ' + sf['Last Name']

In [18]:
sf

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown            USA   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward

In [ ]:
sf['age'] * sf['age']

# Use the apply function to do a advance transformation of our data

In [19]:
sf['Country']

0    United States
1           Canada
2          England
3              USA
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [20]:
sf['Country'].head()

0    United States
1           Canada
2          England
3              USA
4           Poland
Name: Country, dtype: object

In [21]:
def transform_country(country):
    if country == 'USA':
        return 'United States'
    else:
        return country

In [22]:
transform_country('Brazil')

'Brazil'

In [23]:
transform_country('Brasil')

'Brasil'

In [24]:
transform_country('USA')

'United States'

In [25]:
sf['Country'].apply(transform_country)

0    United States
1           Canada
2          England
3    United States
4           Poland
5    United States
6      Switzerland
Name: Country, dtype: object

In [26]:
sf['Country'] = sf['Country'].apply(transform_country)

In [27]:
sf

  First Name Last Name        Country  age       Full Name
0        Bob     Smith  United States   24       Bob Smith
1      Alice  Williams         Canada   23  Alice Williams
2    Malcolm      Jone        England   22    Malcolm Jone
3      Felix     Brown  United States   23     Felix Brown
4       Alex    Cooper         Poland   23     Alex Cooper
5        Tod  Campbell  United States   22    Tod Campbell
6      Derek      Ward    Switzerland   25      Derek Ward